## DNS
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                          NAME                          |
|--------|--------------------------------------------------------|
| update | `aws_route53_record.cds-snc-ca-TXT`                    |
| add    | `aws_route53_record.happyfox-dkim-01-cds-snc-ca-CNAME` |
|        | `aws_route53_record.happyfox-dkim-02-cds-snc-ca-CNAME` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_route53_record.cds-snc-ca-TXT will be updated in-place
  ~ resource "aws_route53_record" "cds-snc-ca-TXT" {
        id                               = "Z35N8HLYUZDWBH_cds-snc.ca_TXT"
        name                             = "cds-snc.ca"
      ~ records                          = [
          + "v=spf1 include:_spf.google.com include:email.freshdesk.com include:spf.happyfox.com ~all",
          - "v=spf1 include:_spf.google.com include:email.freshdesk.com ~all",
            # (3 unchanged elements hidden)
        ]
        # (6 unchanged attributes hidden)
    }

  # aws_route53_record.happyfox-dkim-01-cds-snc-ca-CNAME will be created
  + resource "aws_route53_record" "happyfox-dkim-01-cds-snc-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "happyfox1._domainkey.cds-snc.ca"
      + records         = [
          + "happyfox1._domainkey.happyfox.com",
        ]
      + ttl             = 1800
      + type            = "CNAME"
      + zone_id         = "Z35N8HLYUZDWBH"
    }

  # aws_route53_record.happyfox-dkim-02-cds-snc-ca-CNAME will be created
  + resource "aws_route53_record" "happyfox-dkim-02-cds-snc-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "happyfox2._domainkey.cds-snc.ca"
      + records         = [
          + "happyfox2._domainkey.happyfox.com",
        ]
      + ttl             = 1800
      + type            = "CNAME"
      + zone_id         = "Z35N8HLYUZDWBH"
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.platform-canada-ca-public"]

23 tests, 19 passed, 4 warnings, 0 failures, 0 exceptions

```

</details>
